run/fsiFoam/3dTube/fluid/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    symmetry-x
    {
        type symmetryPlane;
    }
    symmetry-y
    {
        type symmetryPlane;
    }
    outlet
    {
        type fixedValue;
        value uniform 0;
    }
    inlet
    {
        type timeVaryingUniformFixedValue;
        fileName "$FOAM_CASE/time-series";
        outOfBounds clamp;           // (error|warn|clamp|repeat)
    }
    wall
    {
        type extrapolatedPressure;
        value uniform 0;
    }


// ************************************************************************* //
